; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_6)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 - link
    angle0 angle60 angle120 angle180 angle240 angle300 - angle)
(:init
    (AngleOrd angle0 angle60)
    (AngleOrd angle60 angle120)
    (AngleOrd angle120 angle180)
    (AngleOrd angle180 angle240)
    (AngleOrd angle240 angle300)
    (AngleOrd angle300 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)

    (HasAngle angle120 link1)
    (HasAngle angle60 link2)
    (HasAngle angle180 link3)
    (HasAngle angle180 link4)
    (HasAngle angle240 link5)
    (HasAngle angle180 link6)
)
(:goal
(and
    (HasAngle angle60 link1)
    (HasAngle angle120 link2)
    (HasAngle angle0 link3)
    (HasAngle angle180 link4)
    (HasAngle angle300 link5)
    (HasAngle angle180 link6)
    )
)
)

; plan
1. (decrease_angle link1 angle120 angle60)
   deleted: (hasangle angle120 link1) (hasangle angle60 link2) (hasangle angle180 link3) (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle180 link6)
   added: (hasangle angle60 link1) (hasangle angle0 link2) (hasangle angle120 link3) (hasangle angle120 link4) (hasangle angle180 link5) (hasangle angle120 link6)
   goals met: 1 of 6
2. (increase_angle link2 angle0 angle60)
   deleted: (hasangle angle0 link2) (hasangle angle120 link3) (hasangle angle120 link4) (hasangle angle180 link5) (hasangle angle120 link6)
   added: (hasangle angle60 link2) (hasangle angle180 link3) (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle180 link6)
   goals met: 3 of 6
3. (increase_angle link2 angle60 angle120)
   deleted: (hasangle angle60 link2) (hasangle angle180 link3) (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle180 link6)
   added: (hasangle angle120 link2) (hasangle angle240 link3) (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle240 link6)
   goals met: 3 of 6
4. (increase_angle link3 angle240 angle300)
   deleted: (hasangle angle240 link3) (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle240 link6)
   added: (hasangle angle300 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle300 link6)
   goals met: 2 of 6
5. (increase_angle link3 angle300 angle0)
   deleted: (hasangle angle300 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle300 link6)
   added: (hasangle angle0 link3) (hasangle angle0 link4) (hasangle angle60 link5) (hasangle angle0 link6)
   goals met: 3 of 6
6. (decrease_angle link4 angle0 angle300)
   deleted: (hasangle angle0 link4) (hasangle angle60 link5) (hasangle angle0 link6)
   added: (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle300 link6)
   goals met: 3 of 6
7. (decrease_angle link4 angle300 angle240)
   deleted: (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle300 link6)
   added: (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle240 link6)
   goals met: 4 of 6
8. (decrease_angle link4 angle240 angle180)
   deleted: (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle240 link6)
   added: (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle180 link6)
   goals met: 5 of 6
9. (increase_angle link5 angle240 angle300)
   deleted: (hasangle angle240 link5) (hasangle angle180 link6)
   added: (hasangle angle300 link5) (hasangle angle240 link6)
   goals met: 5 of 6
10. (decrease_angle link6 angle240 angle180)
   deleted: (hasangle angle240 link6)
   added: (hasangle angle180 link6)
   goals met: 6 of 6
